#######################################################################################################
#########################################    DB 백업(DUMP)    #########################################
#######################################################################################################

************* 자주 사용되는 dump 옵션 *************
---------------------------------------------------------------
-n, --schema=SCHEMA          지정한 SCHEMA들 자료만 덤프
-N, --exclude-schema=SCHEMA  지정한 SCHEMA들만 빼고 모두 덤프

-s, --schema-only            자료구조(스키마)만 덤프

-t, --table=TABLE            지정한 이름의 테이블들만 덤프
-T, --exclude-table=TABLE    지정한 테이블들만 빼고 덤프

-a, --data-only              스키마 빼고 자료만 덤프
---------------------------------------------------------------


■ DB 백업(9.6버전 기준)

/* ----------------------------------------------------------------------------------------------------
                                           스키마 전체 덤프 ( 방법 1, 2 --> 결과 동일)
---------------------------------------------------------------------------------------------------- */
-- 방법 1) 
pg_dump -Fp -f dump파일명.sql -d DB명 -n 스키마명
ex) pg_dump -Fp -f /data/DBA/work/20190613_CRM19061251154/backup/iotdb_schema_19061313.sql -d iotdb -n iotown

-- 방법 2) 
pg_dump -Fp -d DB명 -n 스키마명 > dump파일명.sql
ex) pg_dump -Fp -d iotdb -n iotown > dump.sql


***** DB 9.1버전에서는 아래와 같이 DB명 앞에 옵션 -d 값을 주지 않는다
pg_dump -Fp -f 파일명.sql DB명 -n 스키마명

/* ----------------------------------------------------------------------------------------------------
                                  스키마 구조(껍데기만, 데이터x)만 덤프
---------------------------------------------------------------------------------------------------- */

pg_dump -Fp -f 파일명.sql -d DB명 -n 스키마명 -s 
ex) pg_dump -Fp -f /data/DBA/work/20190613_CRM19061251154/backup/iotdb_schema_19061313.sql -d iotdb -n iotown -s 


/* ----------------------------------------------------------------------------------------------------
                                            테이블 카피
---------------------------------------------------------------------------------------------------- */

\copy 테이블명 to 'copy경로'
ex. \copy tbl_sendsms_20181112 to '/postgres/9.3AS/dump/tbl_sendsms.csv'












